In [2]:
import pandas as pd

In [9]:
#Crear una serie
Ej1=pd.Series(data=[1,2,3,4],index=['uno','dos','tres','cuatro'],dtype='int64')
Ej1

uno       1
dos       2
tres      3
cuatro    4
dtype: int64

In [10]:
#Crea series con diccionarios
Ej4=pd.Series({'Matematicas':7.8,'Ciencias':8.0})
Ej4

Matematicas    7.8
Ciencias       8.0
dtype: float64

In [11]:
#Series sin palabras de argumento
Ej3=pd.Series([43,56,25,78,96],['aa','bb','cc','dd','ee'])
Ej3

aa    43
bb    56
cc    25
dd    78
ee    96
dtype: int64

In [12]:
#Algunos métodos
print("\n",Ej3.size)
print("\n",Ej3.index)
print("\n",Ej3.dtype)
print("\n",Ej3.values)

 5

 Index(['aa', 'bb', 'cc', 'dd', 'ee'], dtype='object')

 int64

 [43 56 25 78 96]

In [13]:
#Algunas funciones
print("\n",Ej1.count())
print("\n",Ej1.sum())
print("\n",Ej1.cumsum())
print("\n",Ej1.min())
print("\n",Ej1.max())
print("\n ",Ej1.mean())
print("\n",Ej1.std())
print("\n",Ej1.describe())

 4

 10

 uno        1
dos        3
tres       6
cuatro    10
dtype: int64

 1

 4

  2.5

 1.2909944487358056

 count    4.000000
mean     2.500000
std      1.290994
min      1.000000
25%      1.750000
50%      2.500000
75%      3.250000
max      4.000000
dtype: float64

In [23]:
#loc e iloc en series
## Serie con claves
Sc=pd.Series([3,6,8,2,5,14],['a','b','c','d','e','f'])

print(Sc.iloc[4])
print()
print(Sc.iloc[[4]])
print()
print(Sc.loc['e'])
print()
print(Sc.loc[['e']])

5

e    5
dtype: int64

5

e    5
dtype: int64

In [25]:
Ej1=pd.Series([3,6,8,2,5,14],['a','b','c','d','e','f'])
##### DROP  ####### Devuelve una copia
Ej1.drop(['d','e'],inplace=True) #Inplace=True para eliminar en la serie/dataframe original/
Ej1

a     3
b     6
c     8
f    14
dtype: int64

In [28]:
######## POP ##### Borra y retorna el valor
Ej2=pd.Series([3,6,8,2,5,14],['a','b','c','d','e','f'])

DatoEliminar=Ej2.pop('c')
print(DatoEliminar)
Ej2

8

a     3
b     6
d     2
e     5
f    14
dtype: int64

In [29]:
#Creacion de Frames
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
      'year':[2000,2001,2002,2001,2002,2003],
      'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
#Genera un frame con claves automaticas
df=pd.DataFrame(data)
print('Sin claves:\n',df)
#Genera un frame con claves, agregar el atributo "index"
df=pd.DataFrame(data,index=['A','B','C','D','E','F'])
print('Con claves:\n',df)

Sin claves:
     state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2
Con claves:
     state  year  pop
A    Ohio  2000  1.5
B    Ohio  2001  1.7
C    Ohio  2002  3.6
D  Nevada  2001  2.4
E  Nevada  2002  2.9
F  Nevada  2003  3.2

In [30]:
#Con tuplas de datos
df2 = pd.DataFrame([['María', 18], ['Luis', 22], ['Carmen', 20]], columns=['Nombre', 'Edad'],index=[1,2,3])
df2

   Nombre  Edad
1   María    18
2    Luis    22
3  Carmen    20

In [32]:
#Atributos DataFrames
print(df.shape) #(NumFilas, NumColumnas)
print(df.size) #(Numero de datos)
print(df.columns) #Retorna un pandas.Series con los valores de las columnas
print(df.columns.values) #Retorna una lista con los valores de las columnas
print(df.columns.values[1]) #Retorna los elementos de la lista
print(df.values)
print(df.values[3])
print(df.index)
print(df.index.values)
print(df.dtypes)
print(df.dtypes.values)

(6, 3)
18
Index(['state', 'year', 'pop'], dtype='object')
['state' 'year' 'pop']
year
[['Ohio' 2000 1.5]
 ['Ohio' 2001 1.7]
 ['Ohio' 2002 3.6]
 ['Nevada' 2001 2.4]
 ['Nevada' 2002 2.9]
 ['Nevada' 2003 3.2]]
['Nevada' 2001 2.4]
Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')
['A' 'B' 'C' 'D' 'E' 'F']
state     object
year       int64
pop      float64
dtype: object
[dtype('O') dtype('int64') dtype('float64')]

In [33]:
#Funciones
print("\nElementos no nulos: ",df.count())
print("\nSumatoria: ",df.sum())
print("\nSumatoria acumlada: ",df.cumsum())
print("\nMinimo: ",df.min())
print("\nMaximo: ",df.max())

Elementos no nulos:  state    6
year     6
pop      6
dtype: int64

Sumatoria:  state    OhioOhioOhioNevadaNevadaNevada
year                              12009
pop                                15.3
dtype: object

Sumatoria acumlada:                              state   year   pop
A                            Ohio   2000   1.5
B                        OhioOhio   4001   3.2
C                    OhioOhioOhio   6003   6.8
D              OhioOhioOhioNevada   8004   9.2
E        OhioOhioOhioNevadaNevada  10006  12.1
F  OhioOhioOhioNevadaNevadaNevada  12009  15.3

Minimo:  state    Nevada
year       2000
pop         1.5
dtype: object

Maximo:  state    Ohio
year     2003
pop       3.6
dtype: object

In [45]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
      'year':[2000,2001,2002,2001,2002,2003],
      'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
df=pd.DataFrame(data,index=['a','b','c','d','e','f'])
df

    state  year  pop
a    Ohio  2000  1.5
b    Ohio  2001  1.7
c    Ohio  2002  3.6
d  Nevada  2001  2.4
e  Nevada  2002  2.9
f  Nevada  2003  3.2

In [49]:
print(df.iloc[2])
print(df.loc['e'])
print(df.iloc[0,1])
print(df.iloc[0:3,0])
print(df.iloc[[0,2],0])
print(df.loc['c','year'])
print(df.loc[df.index[2],'year'])

state    Ohio
year     2002
pop       3.6
Name: c, dtype: object
state    Nevada
year       2002
pop         2.9
Name: e, dtype: object
2000
a    Ohio
b    Ohio
c    Ohio
Name: state, dtype: object
a    Ohio
c    Ohio
Name: state, dtype: object
2002
2002

In [50]:
#Drop
#Se debe de especificar qué se está borranto: Columnas (axis=1) o filas (axis=0)
df=df.drop('year', axis=1)
print("\nFrame después de borrar el año:",df)

Frame después de borrar el año:     state  pop
a    Ohio  1.5
b    Ohio  1.7
c    Ohio  3.6
d  Nevada  2.4
e  Nevada  2.9
f  Nevada  3.2

In [51]:
df=pd.DataFrame({'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
      'year':[2000,2001,2002,2001,2002,2003],
      'pop':[1.5,1.7,3.6,2.4,2.9,3.2]})
df['status']=['rojo','verde','verde','amarillo','rojo','rojo']
df

    state  year  pop    status
0    Ohio  2000  1.5      rojo
1    Ohio  2001  1.7     verde
2    Ohio  2002  3.6     verde
3  Nevada  2001  2.4  amarillo
4  Nevada  2002  2.9      rojo
5  Nevada  2003  3.2      rojo

In [53]:
#Anexar
anexar=pd.DataFrame([['Ohio','2013',2.7,'rojo'],['Ohio','2013',2.7,'rojo']], columns=df.columns.values)
anexar

  state  year  pop status
0  Ohio  2013  2.7   rojo
1  Ohio  2013  2.7   rojo

In [54]:
#Modificar los índices
print(df.index)
df.index=['q','i','o','u','r','y']
df

RangeIndex(start=0, stop=6, step=1)

    state  year  pop    status
q    Ohio  2000  1.5      rojo
i    Ohio  2001  1.7     verde
o    Ohio  2002  3.6     verde
u  Nevada  2001  2.4  amarillo
r  Nevada  2002  2.9      rojo
y  Nevada  2003  3.2      rojo

In [55]:
#Reajustar los índices
#No cambia valores, solo posiciones
df=df.reindex(['o','i','y','r','u','q'])
df

    state  year  pop    status
o    Ohio  2002  3.6     verde
i    Ohio  2001  1.7     verde
y  Nevada  2003  3.2      rojo
r  Nevada  2002  2.9      rojo
u  Nevada  2001  2.4  amarillo
q    Ohio  2000  1.5      rojo

In [56]:
#Cambiar un índice específico
df=df.rename({'y':'x'})
df=df.rename({'o':'w','i':'b'})
df

    state  year  pop    status
w    Ohio  2002  3.6     verde
b    Ohio  2001  1.7     verde
x  Nevada  2003  3.2      rojo
r  Nevada  2002  2.9      rojo
u  Nevada  2001  2.4  amarillo
q    Ohio  2000  1.5      rojo

In [57]:
#Renombrar columnas
df.columns=['Sucursal', 'Gerente', 'Abril', 'Mayo']
df

  Sucursal  Gerente  Abril      Mayo
w     Ohio     2002    3.6     verde
b     Ohio     2001    1.7     verde
x   Nevada     2003    3.2      rojo
r   Nevada     2002    2.9      rojo
u   Nevada     2001    2.4  amarillo
q     Ohio     2000    1.5      rojo

In [58]:
#Elemento especifico
df=df.rename(index={'ba':'zz'})
df=df.rename(columns={'Sucursal':'Tienda'})

In [59]:
#Por defecto no modifica la serie y ordena ascendentemente
df.sort_index()

   Tienda  Gerente  Abril      Mayo
b    Ohio     2001    1.7     verde
q    Ohio     2000    1.5      rojo
r  Nevada     2002    2.9      rojo
u  Nevada     2001    2.4  amarillo
w    Ohio     2002    3.6     verde
x  Nevada     2003    3.2      rojo

In [60]:
df.sort_index(ascending=False)

   Tienda  Gerente  Abril      Mayo
x  Nevada     2003    3.2      rojo
w    Ohio     2002    3.6     verde
u  Nevada     2001    2.4  amarillo
r  Nevada     2002    2.9      rojo
q    Ohio     2000    1.5      rojo
b    Ohio     2001    1.7     verde

In [61]:
df.sort_index(ascending=False).tail(3)

   Tienda  Gerente  Abril   Mayo
r  Nevada     2002    2.9   rojo
q    Ohio     2000    1.5   rojo
b    Ohio     2001    1.7  verde

In [63]:
#De acuerdo a los valores
df.sort_values(by='Tienda',ascending=False)
df

   Tienda  Gerente  Abril      Mayo
w    Ohio     2002    3.6     verde
b    Ohio     2001    1.7     verde
x  Nevada     2003    3.2      rojo
r  Nevada     2002    2.9      rojo
u  Nevada     2001    2.4  amarillo
q    Ohio     2000    1.5      rojo

In [65]:
#Ordenar por varias columnas (de ezquierda a derecha)
df.sort_values(by=['Tienda','Gerente'],ascending=False) #
df

   Tienda  Gerente  Abril      Mayo
w    Ohio     2002    3.6     verde
b    Ohio     2001    1.7     verde
x  Nevada     2003    3.2      rojo
r  Nevada     2002    2.9      rojo
u  Nevada     2001    2.4  amarillo
q    Ohio     2000    1.5      rojo

In [67]:
#Ordenar por varias columnas, pero en diferente orden
#Categoria --> ascendente
#Enero ---> descendente
df.sort_values(by=['Tienda','Gerente'],ascending=[True,False])
df

   Tienda  Gerente  Abril      Mayo
w    Ohio     2002    3.6     verde
b    Ohio     2001    1.7     verde
x  Nevada     2003    3.2      rojo
r  Nevada     2002    2.9      rojo
u  Nevada     2001    2.4  amarillo
q    Ohio     2000    1.5      rojo

In [68]:
import numpy as np
#Where
#Si las ventas de enero son mayores a 20000, poner "Buenas", si no, poner "Malas"
df['Ventas']=np.where(df['Abril']>4,"Buenas","Malas")
df

   Tienda  Gerente  Abril      Mayo Ventas
w    Ohio     2002    3.6     verde  Malas
b    Ohio     2001    1.7     verde  Malas
x  Nevada     2003    3.2      rojo  Malas
r  Nevada     2002    2.9      rojo  Malas
u  Nevada     2001    2.4  amarillo  Malas
q    Ohio     2000    1.5      rojo  Malas

In [70]:
#Filtros
df[df['Ventas']=="buenas"]

Empty DataFrame
Columns: [Tienda, Gerente, Abril, Mayo, Ventas]
Index: []

In [72]:
#Formato normal
#Año, mes, día, hora, minuto, segundos
#Datetime genera una fecha completa (fecha-hora)
from datetime import date, time, datetime, timedelta
ej=datetime(2020,5,15,15,30,5)
print("Ejemplo DateTime: ",ej)

#Horas
#date genera solo una fecha (año, mes, dia)
ejFecha=date(2020,5,15)
print("Ejemplo Fecha: ",ejFecha)

#time genera solo una hora (hora, minuto, segundo)
ejHora=time(15,30,5)
print("Ejemplo Hora: ",ejHora)

Ejemplo DateTime:  2020-05-15 15:30:05
Ejemplo Fecha:  2020-05-15
Ejemplo Hora:  15:30:05

In [73]:
#Para imprimir la fecha actual: .now()
#Se imprime la fecha y hora del servidor
fechaActual=datetime.now()
print("Fecha actual: ",fechaActual)

#De este modo se pueden extraer caracteristicas específicas de una fecha específica
print("Solo fecha actual: ",fechaActual.date())
print("Solo hora actual: ",fechaActual.time())
print(fechaActual.year)
print(fechaActual.month)

Fecha actual:  2024-08-28 04:33:43.800725
Solo fecha actual:  2024-08-28
Solo hora actual:  04:33:43.800725
2024
8

In [74]:
#Operaciones con datetimes
actual=datetime.now()
nacimiento=datetime(2002,8,16,20,30,5)
print('Tengo',actual.year-nacimiento.year,'años')

Tengo 22 años

In [75]:
#Resuelve aquí el ejercicio
#Calcula las fechas que serán contando a partir de hoy....
#1. 15 semanas
#2. 27 días
#3. 2 semanas, 5 días y 23 hrs
hoy=datetime.now()
print('15 semanas: ',hoy+timedelta(weeks=15))
print('27 días: ',hoy+timedelta(days=27))
print('2 semanas, 5 días y 23 hrs: ',hoy+timedelta(weeks=2,days=5,hours=23))

15 semanas:  2024-12-11 04:35:32.524045
27 días:  2024-09-24 04:35:32.524045
2 semanas, 5 días y 23 hrs:  2024-09-17 03:35:32.524045

In [78]:
#Foramtos
ejFormato=datetime(2020,10,15,15,8)
print("Formato normal: ", ejFormato)
print("Formato cambiado: ", ejFormato.strftime('Son las %I %p, día: %A, mes: %B'))
print("Formato cambiado: ", ejFormato.strftime('%A, %d %B, %Y'))
print('1. Yo nací un',nacimiento.strftime('%A %d'),'de',nacimiento.strftime('%B'),'en el año',nacimiento.year)
print('2. Mi fecha de nacimiento es',nacimiento.strftime('%d--%b--%y'))

Formato normal:  2020-10-15 15:08:00
Formato cambiado:  Son las 03 PM, día: Thursday, mes: October
Formato cambiado:  Thursday, 15 October, 2020
1. Yo nací un Friday 16 de August en el año 2002
2. Mi fecha de nacimiento es 16--Aug--02

In [80]:
#Pasar cadena a fecha

#Se siguen utilizando los parámetros de la página anterior, pepro lal función es s`trptime`

print("\n\nCadenas en fechas\n")
cad='2022-8-18 13:15:45'
#datetime.strptime(FormatoDeCadena, FormatoCon ParametrosDeFecha)
newdate=datetime.strptime('2020-4-15 20:50:30', '%Y-%m-%d %H:%M:%S')
print("Nueva fecha: ",newdate)

#Al utilizar strptime, se debe de tener cuidado de que la cadena cumpla con el patrón descrito
newdate2=datetime.strptime('Son las 03 PM, día: Thursday, mes: October', 'Son las %I %p, día: %A, mes: %B')
print("Nueva fecha: ",newdate2)

Cadenas en fechas

Nueva fecha:  2020-04-15 20:50:30
Nueva fecha:  1900-10-01 15:00:00

In [ ]:
#Leer CSV
Ej=pd.read_csv('Country2.csv', index_col='Code', nrows=20)
Ej=Ej.drop(['SurfaceArea','LifeExpectancy','Continent','Region','LocalName','GovernmentForm','Capital'], axis=1)

In [ ]:
# Leer HTML
Frame=pd.read_html('Ejemplo-3.html',header=0, index_col=0,encoding='utf-8')
len(Frame)
print(Frame[0].head())
print(Frame[1].head())

#imprime el número de filas de cada frame en el archivo (no sabemos cuantos frames existen)
len(Frame)

In [ ]:
Ej.dropna()#Retorna dataframe sin vacios
Ej.isnull()#Retorna dataframe con boleanos verificando si es null
Ej.fillna('--',inplace=True)#Cambia en el dataframe original los vacios por '--'
print("Reemplaza todos los 0's por 9999\n",Ej.replace(0,9999))
Ej[Ej['PrecioCompra'].isnull()]#Filtrar cpor nulos
Duplicadas=Ej.duplicated() #Retorna serie de boleanos con duplicados o no
Ej['Departamento'].duplicated(keep='first')#detecta duplicados y se queda solo el primero last para el ultimo
Ej.drop_duplicates()#Quita duplicados, keep como en duplicates

In [82]:
#Valores únicos en cada columna
df.nunique()

#Muestra los valores únicos por fila (en caso de que una fila tenga el mismo valor en dos o más columnas)
df.nunique(axis=1)

w    5
b    5
x    5
r    5
u    5
q    5
dtype: int64

In [84]:
df['Tienda'].value_counts()

Tienda
Ohio      3
Nevada    3
Name: count, dtype: int64

In [ ]:
#Leer un documento json
#values no cuenta con nombre de columnas ni claves asignadas (numeración)
Frame= pd.read_json('Arch5_values.json', orient='values')
Frame.columns=['Nombre', 'Apellido', 'Depto', 'Puesto', 'Fecha', 'Sueldo']
Frame.head()

In [ ]:
#Leer archivo excel
NewFrame=pd.read_excel('EjemploDatosExcel.xlsx','Hoja1',header=2, index_col=1, skiprows=[1,3,5], usecols='A:C' )
print(NewFrame)

In [ ]:
df2.to_excel('EjemploDatosExcel.xlsx', sheet_name='Prueba2') #Exportar a excel, funciona para todos
Frame=pd.read_csv('EjemploDatosCSV2.csv', delimiter=';')#Leer csv con delimitador